# SQL

## Vorbereitung des Notebooks

Hier nichts verändern.

In [3]:
# Installiert Paket, damit man SQL-Befehle auf Dataframes anwenden kann
!pip install pandasql

# Lädt Paket, damit man Dataframes (Tabellen in Python) anwenden kann
import pandas as pd
# Lädt Paket, damit man SQL-Befehle auf Dataframes anwenden kann
import pandasql as ps

Requirement already satisfied: pandasql in /opt/anaconda3/lib/python3.8/site-packages (0.7.3)
Requirement already satisfied: numpy in /opt/anaconda3/lib/python3.8/site-packages (from pandasql) (1.20.1)
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.8/site-packages (from pandasql) (1.2.4)
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.8/site-packages (from pandasql) (1.4.7)
Requirement already satisfied: python-dateutil>=2.7.3 in /opt/anaconda3/lib/python3.8/site-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /opt/anaconda3/lib/python3.8/site-packages (from pandas->pandasql) (2021.1)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy->pandasql) (1.0.0)
Note: you may need to restart the kernel to use updated packages.

## Datenbeschreibung

Performance_data ist ein Datensatz über vorangegangene Leistungstests (VO2_max). Zudem enthält es Informationen über das Geschlecht und Alter der Untersuchten, ob diese rauchen oder nicht, deren Körpergröße und Gewicht, sowie die die Diagnostikerin, die den Test durchgeführt hat. Zudem wird der Erlös erhoben, der bei der Krankenkasse für die Diagnostik verrechnet wurde.

### Aufgabe

Laden die die Daten in einen pandas DataFrame und zeigen Sie diese an.

In [5]:
performance_data = pd.read_csv("test_data.csv")
performance_data

,Unnamed: 0,VO2_max,age,smoker,height,weight,revenue,diagnostician_id,gender
0,0,45,66,True,165,76,30,2,Male
1,1,37,58,False,180,87,32,1,Female
2,2,54,27,False,155,62,29,0,Male
3,3,58,32,False,183,78,26,0,Male
4,4,45,75,True,166,101,10,2,Female
...,...,...,...,...,...,...,...,...,...
195,195,55,24,True,160,74,11,3,Male
196,196,46,17,False,172,92,18,3,Male
197,197,61,52,False,164,84,29,0,Female
198,198,67,46,True,164,78,39,1,Male
199,199,43,39,False,162,107,36,1,Male

In [4]:
# Lösung
# Lade die Daten in einen pandas Dataframe namens "performance_data"
performance_data = pd.read_csv("test_data.csv")

# Zeige performance_data an
performance_data

,Unnamed: 0,VO2_max,age,smoker,height,weight,revenue,diagnostician_id,gender
0,0,45,66,True,165,76,30,2,Male
1,1,37,58,False,180,87,32,1,Female
2,2,54,27,False,155,62,29,0,Male
3,3,58,32,False,183,78,26,0,Male
4,4,45,75,True,166,101,10,2,Female
...,...,...,...,...,...,...,...,...,...
195,195,55,24,True,160,74,11,3,Male
196,196,46,17,False,172,92,18,3,Male
197,197,61,52,False,164,84,29,0,Female
198,198,67,46,True,164,78,39,1,Male
199,199,43,39,False,162,107,36,1,Male

# Aufgaben

1. Was sind die höchsten drei Erlöse, die erzielt wurden?

In [16]:
ps.sqldf("SELECT revenue, age FROM performance_data ORDER BY revenue DESC LIMIT 3")

   revenue  age
0       49   54
1       49   63
2       49   88

2. Was sind die höchsten drei Erlöse, die mit Nicht-Rauchern erzielt wurden?

In [17]:
ps.sqldf("SELECT revenue, age FROM performance_data WHERE smoker = TRUE ORDER BY revenue DESC LIMIT 3")

   revenue  age
0       49   54
1       49   63
2       48   76

3. Wie leistungsfähig sind Personen mit Gewicht über 80kg verglichen mit leichteren Personen? (2 Befehle)

In [33]:
print(ps.sqldf("""SELECT gender, VO2_max, weight, revenue FROM performance_data WHERE weight > 80 """) )
print(ps.sqldf("""SELECT gender, VO2_max, weight, revenue FROM performance_data WHERE weight < 80 """) )

     gender  VO2_max  weight  revenue
0    Female       37      87       32
1    Female       45     101       10
2    Female       54      91       23
3    Female       62      83       25
4    Female       42      94       14
..      ...      ...     ...      ...
101  Female       38     101       46
102  Female       61     108       21
103    Male       46      92       18
104  Female       61      84       29
105    Male       43     107       36

[106 rows x 4 columns]
    gender  VO2_max  weight  revenue
0     Male       45      76       30
1     Male       54      62       29
2     Male       58      78       26
3     Male       33      70       44
4     Male       65      64       36
..     ...      ...     ...      ...
83    Male       46      79       15
84  Female       40      67       42
85    Male       47      66       22
86    Male       55      74       11
87    Male       67      78       39

[88 rows x 4 columns]

4. Was ist die Durchschnittsleistung von Frauen über 170cm?

In [9]:
ps.sqldf("""SELECT AVG(VO2_max) FROM performance_data WHERE gender="Female" AND height >170 """)

   AVG(VO2_max)
0     47.390244

5. Wie viel Umsatz haben die einzelnen Diagnostiker:innen erzielt?

In [19]:
ps.sqldf("""SELECT revenue FROM performance_data """)

     revenue
0         30
1         32
2         29
3         26
4         10
..       ...
195       11
196       18
197       29
198       39
199       36

[200 rows x 1 columns]

6. Wie ist die durchschnittliche Leistung von Rauchern und Nicht-Rauchern, die von den Diagnostiker:innen 0 und 1 betreut wurden.

In [18]:
ps.sqldf("""SELECT AVG(VO2_max) FROM performance_data WHERE diagnostician_id= 0 or 1 GROUP BY smoker """)

   AVG(VO2_max)
0     48.990099
1     48.909091